#loc1 = loc("W0")
#loc2 = loc("b0")
#loc3 = loc("W1")
#loc4 = loc("b1")
#loc5 = loc("W2")
#loc6 = loc("b2")
#loc7 = loc("W3")
#loc8 = loc("b3")
#loc9 = loc("W4")
#loc10 = loc("b4")
#loc11 = loc("x")
#loc12 = loc("y")
#loc13 = loc("lr")
#loc15 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_cnn_train_step.py":24:0 to 0:0)
#loc16 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_cnn_train_step.py":29:0 to 0:0)
#loc17 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_cnn_train_step.py":50:0 to 0:0)
#loc18 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_cnn_train_step.py":12:0 to 0:0)
#loc22 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_cnn_train_step.py":16:0 to 0:0)
#loc24 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_cnn_train_step.py":19:0 to 0:0)
#loc27 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_cnn_train_step.py":25:0 to 0:0)
#loc28 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_cnn_train_step.py":26:0 to 0:0)
#loc31 = loc("loss_fn"(#loc15))
#loc32 = loc("train_step"(#loc16))
#loc33 = loc("<module>"(#loc17))
#loc34 = loc("forward"(#loc18))
#loc38 = loc("forward"(#loc22))
#loc40 = loc("forward"(#loc24))
#loc43 = loc("loss_fn"(#loc27))
#loc44 = loc("loss_fn"(#loc28))
#loc47 = loc(callsite(#loc32 at #loc33))
#loc49 = loc(callsite(#loc31 at #loc47))
#loc50 = loc(callsite(#loc43 at #loc47))
#loc51 = loc(callsite(#loc44 at #loc47))
#loc54 = loc(callsite(#loc34 at #loc49))
#loc58 = loc(callsite(#loc38 at #loc49))
#loc60 = loc(callsite(#loc40 at #loc49))
#loc63 = loc("jit(train_step)/jit(main)/pjit"(#loc50))
#loc74 = loc("jit(train_step)/jit(main)/scatter-add"(#loc51))
#loc96 = loc("jit(train_step)/jit(main)/pjit"(#loc54))
#loc103 = loc("jit(train_step)/jit(main)/reduce_window_max"(#loc58))
#loc108 = loc("jit(train_step)/jit(main)/pjit"(#loc60))
#loc130 = loc("jit(train_step)/jit(main)/select_and_scatter"(#loc58))
module @jit_train_step attributes {jax.uses_shape_polymorphism = false, mhlo.num_partitions = 1 : i32, mhlo.num_replicas = 1 : i32} {
  func.func public @main(%arg0: tensor<3x3x1x32xf32> loc("W0"), %arg1: tensor<32xf32> loc("b0"), %arg2: tensor<3x3x32x32xf32> loc("W1"), %arg3: tensor<32xf32> loc("b1"), %arg4: tensor<6272x512xf32> loc("W2"), %arg5: tensor<512xf32> loc("b2"), %arg6: tensor<512x512xf32> loc("W3"), %arg7: tensor<512xf32> loc("b3"), %arg8: tensor<512x10xf32> loc("W4"), %arg9: tensor<10xf32> loc("b4"), %arg10: tensor<128x784xf32> loc("x"), %arg11: tensor<128xi32> loc("y"), %arg12: tensor<f32> loc("lr")) -> (tensor<3x3x1x32xf32> {jax.result_info = "result[0]"}, tensor<32xf32> {jax.result_info = "result[1]"}, tensor<3x3x32x32xf32> {jax.result_info = "result[2]"}, tensor<32xf32> {jax.result_info = "result[3]"}, tensor<6272x512xf32> {jax.result_info = "result[4]"}, tensor<512xf32> {jax.result_info = "result[5]"}, tensor<512x512xf32> {jax.result_info = "result[6]"}, tensor<512xf32> {jax.result_info = "result[7]"}, tensor<512x10xf32> {jax.result_info = "result[8]"}, tensor<10xf32> {jax.result_info = "result[9]"}, tensor<f32> {jax.result_info = "result[10]"}) {
    %cst = stablehlo.constant dense<1.000000e+00> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<1.280000e+02> : tensor<f32> loc(#loc)
    %c = stablehlo.constant dense<10> : tensor<i32> loc(#loc)
    %c_1 = stablehlo.constant dense<128> : tensor<i32> loc(#loc)
    %c_2 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %cst_3 = stablehlo.constant dense<0xFF800000> : tensor<f32> loc(#loc)
    %cst_4 = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %0 = stablehlo.reshape %arg10 : (tensor<128x784xf32>) -> tensor<128x28x28x1xf32> loc(#loc92)
    %1 = stablehlo.convolution(%0, %arg0) dim_numbers = [b, 0, 1, f]x[0, 1, i, o]->[b, 0, 1, f], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<128x28x28x1xf32>, tensor<3x3x1x32xf32>) -> tensor<128x28x28x32xf32> loc(#loc93)
    %2 = stablehlo.reshape %arg1 : (tensor<32xf32>) -> tensor<1x1x1x32xf32> loc(#loc94)
    %3 = stablehlo.broadcast_in_dim %2, dims = [0, 1, 2, 3] : (tensor<1x1x1x32xf32>) -> tensor<128x28x28x32xf32> loc(#loc95)
    %4 = stablehlo.add %1, %3 : tensor<128x28x28x32xf32> loc(#loc95)
    %5 = call @relu(%4) : (tensor<128x28x28x32xf32>) -> tensor<128x28x28x32xf32> loc(#loc96)
    %6 = stablehlo.broadcast_in_dim %cst_4, dims = [] : (tensor<f32>) -> tensor<128x28x28x32xf32> loc(#loc97)
    %7 = stablehlo.compare  GT, %4, %6,  FLOAT : (tensor<128x28x28x32xf32>, tensor<128x28x28x32xf32>) -> tensor<128x28x28x32xi1> loc(#loc97)
    %8 = stablehlo.convolution(%5, %arg2) dim_numbers = [b, 0, 1, f]x[0, 1, i, o]->[b, 0, 1, f], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<128x28x28x32xf32>, tensor<3x3x32x32xf32>) -> tensor<128x28x28x32xf32> loc(#loc98)
    %9 = stablehlo.reshape %arg3 : (tensor<32xf32>) -> tensor<1x1x1x32xf32> loc(#loc99)
    %10 = stablehlo.broadcast_in_dim %9, dims = [0, 1, 2, 3] : (tensor<1x1x1x32xf32>) -> tensor<128x28x28x32xf32> loc(#loc100)
    %11 = stablehlo.add %8, %10 : tensor<128x28x28x32xf32> loc(#loc100)
    %12 = call @relu(%11) : (tensor<128x28x28x32xf32>) -> tensor<128x28x28x32xf32> loc(#loc101)
    %13 = stablehlo.broadcast_in_dim %cst_4, dims = [] : (tensor<f32>) -> tensor<128x28x28x32xf32> loc(#loc102)
    %14 = stablehlo.compare  GT, %11, %13,  FLOAT : (tensor<128x28x28x32xf32>, tensor<128x28x28x32xf32>) -> tensor<128x28x28x32xi1> loc(#loc102)
    %15 = stablehlo.broadcast_in_dim %cst_3, dims = [] : (tensor<f32>) -> tensor<f32> loc(#loc103)
    %16 = "stablehlo.reduce_window"(%12, %15) <{window_dimensions = array<i64: 1, 2, 2, 1>, window_strides = array<i64: 1, 2, 2, 1>}> ({
    ^bb0(%arg13: tensor<f32> loc("jit(train_step)/jit(main)/reduce_window_max"(#loc58)), %arg14: tensor<f32> loc("jit(train_step)/jit(main)/reduce_window_max"(#loc58))):
      %132 = stablehlo.maximum %arg13, %arg14 : tensor<f32> loc(#loc103)
      stablehlo.return %132 : tensor<f32> loc(#loc103)
    }) : (tensor<128x28x28x32xf32>, tensor<f32>) -> tensor<128x14x14x32xf32> loc(#loc103)
    %17 = stablehlo.reshape %16 : (tensor<128x14x14x32xf32>) -> tensor<128x6272xf32> loc(#loc104)
    %18 = stablehlo.dot_general %17, %arg4, contracting_dims = [1] x [0] : (tensor<128x6272xf32>, tensor<6272x512xf32>) -> tensor<128x512xf32> loc(#loc105)
    %19 = stablehlo.broadcast_in_dim %arg5, dims = [1] : (tensor<512xf32>) -> tensor<1x512xf32> loc(#loc106)
    %20 = stablehlo.broadcast_in_dim %19, dims = [0, 1] : (tensor<1x512xf32>) -> tensor<128x512xf32> loc(#loc107)
    %21 = stablehlo.add %18, %20 : tensor<128x512xf32> loc(#loc107)
    %22 = call @relu_0(%21) : (tensor<128x512xf32>) -> tensor<128x512xf32> loc(#loc108)
    %23 = stablehlo.broadcast_in_dim %cst_4, dims = [] : (tensor<f32>) -> tensor<128x512xf32> loc(#loc109)
    %24 = stablehlo.compare  GT, %21, %23,  FLOAT : (tensor<128x512xf32>, tensor<128x512xf32>) -> tensor<128x512xi1> loc(#loc109)
    %25 = stablehlo.dot_general %22, %arg6, contracting_dims = [1] x [0] : (tensor<128x512xf32>, tensor<512x512xf32>) -> tensor<128x512xf32> loc(#loc110)
    %26 = stablehlo.broadcast_in_dim %arg7, dims = [1] : (tensor<512xf32>) -> tensor<1x512xf32> loc(#loc111)
    %27 = stablehlo.broadcast_in_dim %26, dims = [0, 1] : (tensor<1x512xf32>) -> tensor<128x512xf32> loc(#loc112)
    %28 = stablehlo.add %25, %27 : tensor<128x512xf32> loc(#loc112)
    %29 = call @relu_0(%28) : (tensor<128x512xf32>) -> tensor<128x512xf32> loc(#loc113)
    %30 = stablehlo.broadcast_in_dim %cst_4, dims = [] : (tensor<f32>) -> tensor<128x512xf32> loc(#loc114)
    %31 = stablehlo.compare  GT, %28, %30,  FLOAT : (tensor<128x512xf32>, tensor<128x512xf32>) -> tensor<128x512xi1> loc(#loc114)
    %32 = stablehlo.dot_general %29, %arg8, contracting_dims = [1] x [0] : (tensor<128x512xf32>, tensor<512x10xf32>) -> tensor<128x10xf32> loc(#loc115)
    %33 = stablehlo.broadcast_in_dim %arg9, dims = [1] : (tensor<10xf32>) -> tensor<1x10xf32> loc(#loc116)
    %34 = stablehlo.broadcast_in_dim %33, dims = [0, 1] : (tensor<1x10xf32>) -> tensor<128x10xf32> loc(#loc117)
    %35 = stablehlo.add %32, %34 : tensor<128x10xf32> loc(#loc117)
    %36:3 = call @log_softmax(%35) : (tensor<128x10xf32>) -> (tensor<128x10xf32>, tensor<128x10xf32>, tensor<128x1xf32>) loc(#loc63)
    %37 = stablehlo.iota dim = 0 : tensor<128xi32> loc(#loc64)
    %38 = stablehlo.broadcast_in_dim %c_2, dims = [] : (tensor<i32>) -> tensor<128xi32> loc(#loc65)
    %39 = stablehlo.compare  LT, %37, %38,  SIGNED : (tensor<128xi32>, tensor<128xi32>) -> tensor<128xi1> loc(#loc65)
    %40 = stablehlo.broadcast_in_dim %c_1, dims = [] : (tensor<i32>) -> tensor<128xi32> loc(#loc66)
    %41 = stablehlo.add %37, %40 : tensor<128xi32> loc(#loc66)
    %42 = stablehlo.select %39, %41, %37 : tensor<128xi1>, tensor<128xi32> loc(#loc67)
    %43 = stablehlo.broadcast_in_dim %c_2, dims = [] : (tensor<i32>) -> tensor<128xi32> loc(#loc65)
    %44 = stablehlo.compare  LT, %arg11, %43,  SIGNED : (tensor<128xi32>, tensor<128xi32>) -> tensor<128xi1> loc(#loc65)
    %45 = stablehlo.broadcast_in_dim %c, dims = [] : (tensor<i32>) -> tensor<128xi32> loc(#loc66)
    %46 = stablehlo.add %arg11, %45 : tensor<128xi32> loc(#loc66)
    %47 = stablehlo.select %44, %46, %arg11 : tensor<128xi1>, tensor<128xi32> loc(#loc67)
    %48 = stablehlo.broadcast_in_dim %42, dims = [0] : (tensor<128xi32>) -> tensor<128x1xi32> loc(#loc68)
    %49 = stablehlo.broadcast_in_dim %47, dims = [0] : (tensor<128xi32>) -> tensor<128x1xi32> loc(#loc68)
    %50 = stablehlo.concatenate %48, %49, dim = 1 : (tensor<128x1xi32>, tensor<128x1xi32>) -> tensor<128x2xi32> loc(#loc69)
    %51 = "stablehlo.gather"(%36#0, %50) <{dimension_numbers = #stablehlo.gather<collapsed_slice_dims = [0, 1], start_index_map = [0, 1], index_vector_dim = 1>, slice_sizes = array<i64: 1, 1>}> : (tensor<128x10xf32>, tensor<128x2xi32>) -> tensor<128xf32> loc(#loc70)
    %52 = stablehlo.reduce(%51 init: %cst_4) applies stablehlo.add across dimensions = [0] : (tensor<128xf32>, tensor<f32>) -> tensor<f32> loc(#loc71)
    %53 = stablehlo.divide %52, %cst_0 : tensor<f32> loc(#loc72)
    %54 = stablehlo.negate %53 : tensor<f32> loc(#loc73)
    %55 = stablehlo.negate %cst : tensor<f32> loc(#loc73)
    %56 = stablehlo.divide %55, %cst_0 : tensor<f32> loc(#loc72)
    %57 = stablehlo.broadcast_in_dim %56, dims = [] : (tensor<f32>) -> tensor<128xf32> loc(#loc68)
    %58 = stablehlo.reduce(%57 init: %cst_4) applies stablehlo.add across dimensions = [] : (tensor<128xf32>, tensor<f32>) -> tensor<128xf32> loc(#loc71)
    %59 = stablehlo.broadcast_in_dim %cst_4, dims = [] : (tensor<f32>) -> tensor<128x10xf32> loc(#loc68)
    %60 = "stablehlo.scatter"(%59, %50, %58) <{scatter_dimension_numbers = #stablehlo.scatter<inserted_window_dims = [0, 1], scatter_dims_to_operand_dims = [0, 1], index_vector_dim = 1>}> ({
    ^bb0(%arg13: tensor<f32> loc("jit(train_step)/jit(main)/scatter-add"(#loc51)), %arg14: tensor<f32> loc("jit(train_step)/jit(main)/scatter-add"(#loc51))):
      %132 = stablehlo.add %arg13, %arg14 : tensor<f32> loc(#loc75)
      stablehlo.return %132 : tensor<f32> loc(#loc74)
    }) : (tensor<128x10xf32>, tensor<128x2xi32>, tensor<128xf32>) -> tensor<128x10xf32> loc(#loc74)
    %61 = call @log_softmax_1(%36#1, %36#2, %60) : (tensor<128x10xf32>, tensor<128x1xf32>, tensor<128x10xf32>) -> tensor<128x10xf32> loc(#loc63)
    %62 = stablehlo.reduce(%61 init: %cst_4) applies stablehlo.add across dimensions = [0] : (tensor<128x10xf32>, tensor<f32>) -> tensor<10xf32> loc(#loc118)
    %63 = stablehlo.reshape %62 : (tensor<10xf32>) -> tensor<1x10xf32> loc(#loc119)
    %64 = stablehlo.reduce(%63 init: %cst_4) applies stablehlo.add across dimensions = [0] : (tensor<1x10xf32>, tensor<f32>) -> tensor<10xf32> loc(#loc118)
    %65 = stablehlo.dot_general %61, %29, contracting_dims = [0] x [0] : (tensor<128x10xf32>, tensor<128x512xf32>) -> tensor<10x512xf32> loc(#loc115)
    %66 = stablehlo.transpose %65, dims = [1, 0] : (tensor<10x512xf32>) -> tensor<512x10xf32> loc(#loc120)
    %67 = stablehlo.dot_general %61, %arg8, contracting_dims = [1] x [1] : (tensor<128x10xf32>, tensor<512x10xf32>) -> tensor<128x512xf32> loc(#loc115)
    %68 = stablehlo.broadcast_in_dim %cst_4, dims = [] : (tensor<f32>) -> tensor<128x512xf32> loc(#loc111)
    %69 = stablehlo.select %31, %67, %68 : tensor<128x512xi1>, tensor<128x512xf32> loc(#loc121)
    %70 = stablehlo.reduce(%69 init: %cst_4) applies stablehlo.add across dimensions = [0] : (tensor<128x512xf32>, tensor<f32>) -> tensor<512xf32> loc(#loc122)
    %71 = stablehlo.reshape %70 : (tensor<512xf32>) -> tensor<1x512xf32> loc(#loc123)
    %72 = stablehlo.reduce(%71 init: %cst_4) applies stablehlo.add across dimensions = [0] : (tensor<1x512xf32>, tensor<f32>) -> tensor<512xf32> loc(#loc122)
    %73 = stablehlo.dot_general %69, %22, contracting_dims = [0] x [0] : (tensor<128x512xf32>, tensor<128x512xf32>) -> tensor<512x512xf32> loc(#loc110)
    %74 = stablehlo.transpose %73, dims = [1, 0] : (tensor<512x512xf32>) -> tensor<512x512xf32> loc(#loc124)
    %75 = stablehlo.dot_general %69, %arg6, contracting_dims = [1] x [1] : (tensor<128x512xf32>, tensor<512x512xf32>) -> tensor<128x512xf32> loc(#loc110)
    %76 = stablehlo.broadcast_in_dim %cst_4, dims = [] : (tensor<f32>) -> tensor<128x512xf32> loc(#loc106)
    %77 = stablehlo.select %24, %75, %76 : tensor<128x512xi1>, tensor<128x512xf32> loc(#loc125)
    %78 = stablehlo.reduce(%77 init: %cst_4) applies stablehlo.add across dimensions = [0] : (tensor<128x512xf32>, tensor<f32>) -> tensor<512xf32> loc(#loc126)
    %79 = stablehlo.reshape %78 : (tensor<512xf32>) -> tensor<1x512xf32> loc(#loc127)
    %80 = stablehlo.reduce(%79 init: %cst_4) applies stablehlo.add across dimensions = [0] : (tensor<1x512xf32>, tensor<f32>) -> tensor<512xf32> loc(#loc126)
    %81 = stablehlo.dot_general %77, %17, contracting_dims = [0] x [0] : (tensor<128x512xf32>, tensor<128x6272xf32>) -> tensor<512x6272xf32> loc(#loc105)
    %82 = stablehlo.transpose %81, dims = [1, 0] : (tensor<512x6272xf32>) -> tensor<6272x512xf32> loc(#loc128)
    %83 = stablehlo.dot_general %77, %arg4, contracting_dims = [1] x [1] : (tensor<128x512xf32>, tensor<6272x512xf32>) -> tensor<128x6272xf32> loc(#loc105)
    %84 = stablehlo.reshape %83 : (tensor<128x6272xf32>) -> tensor<128x14x14x32xf32> loc(#loc104)
    %85 = stablehlo.pad %12, %cst_3, low = [0, 0, 0, 0], high = [0, 0, 0, 0], interior = [0, 0, 0, 0] : (tensor<128x28x28x32xf32>, tensor<f32>) -> tensor<128x28x28x32xf32> loc(#loc129)
    %86 = "stablehlo.select_and_scatter"(%85, %84, %cst_4) <{window_dimensions = array<i64: 1, 2, 2, 1>, window_strides = array<i64: 1, 2, 2, 1>}> ({
    ^bb0(%arg13: tensor<f32> loc("jit(train_step)/jit(main)/select_and_scatter"(#loc58)), %arg14: tensor<f32> loc("jit(train_step)/jit(main)/select_and_scatter"(#loc58))):
      %132 = stablehlo.compare  GE, %arg13, %arg14,  FLOAT : (tensor<f32>, tensor<f32>) -> tensor<i1> loc(#loc131)
      stablehlo.return %132 : tensor<i1> loc(#loc130)
    }, {
    ^bb0(%arg13: tensor<f32> loc("jit(train_step)/jit(main)/select_and_scatter"(#loc58)), %arg14: tensor<f32> loc("jit(train_step)/jit(main)/select_and_scatter"(#loc58))):
      %132 = stablehlo.add %arg13, %arg14 : tensor<f32> loc(#loc66)
      stablehlo.return %132 : tensor<f32> loc(#loc130)
    }) : (tensor<128x28x28x32xf32>, tensor<128x14x14x32xf32>, tensor<f32>) -> tensor<128x28x28x32xf32> loc(#loc130)
    %87 = stablehlo.slice %86 [0:128, 0:28, 0:28, 0:32] : (tensor<128x28x28x32xf32>) -> tensor<128x28x28x32xf32> loc(#loc132)
    %88 = stablehlo.broadcast_in_dim %cst_4, dims = [] : (tensor<f32>) -> tensor<128x28x28x32xf32> loc(#loc133)
    %89 = stablehlo.select %14, %87, %88 : tensor<128x28x28x32xi1>, tensor<128x28x28x32xf32> loc(#loc134)
    %90 = stablehlo.reduce(%89 init: %cst_4) applies stablehlo.add across dimensions = [0, 1, 2] : (tensor<128x28x28x32xf32>, tensor<f32>) -> tensor<32xf32> loc(#loc135)
    %91 = stablehlo.reshape %90 : (tensor<32xf32>) -> tensor<1x1x1x32xf32> loc(#loc136)
    %92 = stablehlo.reshape %91 : (tensor<1x1x1x32xf32>) -> tensor<32xf32> loc(#loc99)
    %93 = stablehlo.convolution(%5, %89) dim_numbers = [f, 0, 1, b]x[i, 0, 1, o]->[0, 1, b, f], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<128x28x28x32xf32>, tensor<128x28x28x32xf32>) -> tensor<3x3x32x32xf32> loc(#loc98)
    %94 = stablehlo.reverse %arg2, dims = [0, 1] : tensor<3x3x32x32xf32> loc(#loc137)
    %95 = stablehlo.convolution(%89, %94) dim_numbers = [b, 0, 1, f]x[0, 1, o, i]->[b, 0, 1, f], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<128x28x28x32xf32>, tensor<3x3x32x32xf32>) -> tensor<128x28x28x32xf32> loc(#loc98)
    %96 = stablehlo.broadcast_in_dim %cst_4, dims = [] : (tensor<f32>) -> tensor<128x28x28x32xf32> loc(#loc138)
    %97 = stablehlo.select %7, %95, %96 : tensor<128x28x28x32xi1>, tensor<128x28x28x32xf32> loc(#loc139)
    %98 = stablehlo.reduce(%97 init: %cst_4) applies stablehlo.add across dimensions = [0, 1, 2] : (tensor<128x28x28x32xf32>, tensor<f32>) -> tensor<32xf32> loc(#loc140)
    %99 = stablehlo.reshape %98 : (tensor<32xf32>) -> tensor<1x1x1x32xf32> loc(#loc141)
    %100 = stablehlo.reshape %99 : (tensor<1x1x1x32xf32>) -> tensor<32xf32> loc(#loc94)
    %101 = stablehlo.convolution(%0, %97) dim_numbers = [f, 0, 1, b]x[i, 0, 1, o]->[0, 1, b, f], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<128x28x28x1xf32>, tensor<128x28x28x32xf32>) -> tensor<3x3x1x32xf32> loc(#loc93)
    %102 = stablehlo.broadcast_in_dim %arg12, dims = [] : (tensor<f32>) -> tensor<3x3x1x32xf32> loc(#loc76)
    %103 = stablehlo.multiply %102, %101 : tensor<3x3x1x32xf32> loc(#loc76)
    %104 = stablehlo.subtract %arg0, %103 : tensor<3x3x1x32xf32> loc(#loc77)
    %105 = stablehlo.broadcast_in_dim %arg12, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc76)
    %106 = stablehlo.multiply %105, %100 : tensor<32xf32> loc(#loc76)
    %107 = stablehlo.subtract %arg1, %106 : tensor<32xf32> loc(#loc77)
    %108 = stablehlo.broadcast_in_dim %arg12, dims = [] : (tensor<f32>) -> tensor<3x3x32x32xf32> loc(#loc76)
    %109 = stablehlo.multiply %108, %93 : tensor<3x3x32x32xf32> loc(#loc76)
    %110 = stablehlo.subtract %arg2, %109 : tensor<3x3x32x32xf32> loc(#loc77)
    %111 = stablehlo.broadcast_in_dim %arg12, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc76)
    %112 = stablehlo.multiply %111, %92 : tensor<32xf32> loc(#loc76)
    %113 = stablehlo.subtract %arg3, %112 : tensor<32xf32> loc(#loc77)
    %114 = stablehlo.broadcast_in_dim %arg12, dims = [] : (tensor<f32>) -> tensor<6272x512xf32> loc(#loc76)
    %115 = stablehlo.multiply %114, %82 : tensor<6272x512xf32> loc(#loc76)
    %116 = stablehlo.subtract %arg4, %115 : tensor<6272x512xf32> loc(#loc77)
    %117 = stablehlo.broadcast_in_dim %arg12, dims = [] : (tensor<f32>) -> tensor<512xf32> loc(#loc76)
    %118 = stablehlo.multiply %117, %80 : tensor<512xf32> loc(#loc76)
    %119 = stablehlo.subtract %arg5, %118 : tensor<512xf32> loc(#loc77)
    %120 = stablehlo.broadcast_in_dim %arg12, dims = [] : (tensor<f32>) -> tensor<512x512xf32> loc(#loc76)
    %121 = stablehlo.multiply %120, %74 : tensor<512x512xf32> loc(#loc76)
    %122 = stablehlo.subtract %arg6, %121 : tensor<512x512xf32> loc(#loc77)
    %123 = stablehlo.broadcast_in_dim %arg12, dims = [] : (tensor<f32>) -> tensor<512xf32> loc(#loc76)
    %124 = stablehlo.multiply %123, %72 : tensor<512xf32> loc(#loc76)
    %125 = stablehlo.subtract %arg7, %124 : tensor<512xf32> loc(#loc77)
    %126 = stablehlo.broadcast_in_dim %arg12, dims = [] : (tensor<f32>) -> tensor<512x10xf32> loc(#loc76)
    %127 = stablehlo.multiply %126, %66 : tensor<512x10xf32> loc(#loc76)
    %128 = stablehlo.subtract %arg8, %127 : tensor<512x10xf32> loc(#loc77)
    %129 = stablehlo.broadcast_in_dim %arg12, dims = [] : (tensor<f32>) -> tensor<10xf32> loc(#loc76)
    %130 = stablehlo.multiply %129, %64 : tensor<10xf32> loc(#loc76)
    %131 = stablehlo.subtract %arg9, %130 : tensor<10xf32> loc(#loc77)
    return %104, %107, %110, %113, %116, %119, %122, %125, %128, %131, %54 : tensor<3x3x1x32xf32>, tensor<32xf32>, tensor<3x3x32x32xf32>, tensor<32xf32>, tensor<6272x512xf32>, tensor<512xf32>, tensor<512x512xf32>, tensor<512xf32>, tensor<512x10xf32>, tensor<10xf32>, tensor<f32> loc(#loc)
  } loc(#loc)
  func.func private @relu(%arg0: tensor<128x28x28x32xf32> loc("jit(train_step)/jit(main)/pjit"(#loc54))) -> tensor<128x28x28x32xf32> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc96)
    %0 = stablehlo.broadcast_in_dim %cst, dims = [] : (tensor<f32>) -> tensor<128x28x28x32xf32> loc(#loc142)
    %1 = stablehlo.maximum %arg0, %0 : tensor<128x28x28x32xf32> loc(#loc142)
    return %1 : tensor<128x28x28x32xf32> loc(#loc96)
  } loc(#loc96)
  func.func private @relu_0(%arg0: tensor<128x512xf32> loc("jit(train_step)/jit(main)/pjit"(#loc60))) -> tensor<128x512xf32> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc108)
    %0 = stablehlo.broadcast_in_dim %cst, dims = [] : (tensor<f32>) -> tensor<128x512xf32> loc(#loc143)
    %1 = stablehlo.maximum %arg0, %0 : tensor<128x512xf32> loc(#loc143)
    return %1 : tensor<128x512xf32> loc(#loc108)
  } loc(#loc108)
  func.func private @log_softmax(%arg0: tensor<128x10xf32> loc("jit(train_step)/jit(main)/pjit"(#loc50))) -> (tensor<128x10xf32>, tensor<128x10xf32>, tensor<128x1xf32>) {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<0xFF800000> : tensor<f32> loc(#loc)
    %0 = stablehlo.reduce(%arg0 init: %cst_0) applies stablehlo.maximum across dimensions = [1] : (tensor<128x10xf32>, tensor<f32>) -> tensor<128xf32> loc(#loc78)
    %1 = stablehlo.broadcast_in_dim %cst_0, dims = [] : (tensor<f32>) -> tensor<128xf32> loc(#loc79)
    %2 = stablehlo.maximum %1, %0 : tensor<128xf32> loc(#loc79)
    %3 = stablehlo.broadcast_in_dim %2, dims = [0] : (tensor<128xf32>) -> tensor<128x1xf32> loc(#loc80)
    %4 = stablehlo.broadcast_in_dim %3, dims = [0, 1] : (tensor<128x1xf32>) -> tensor<128x10xf32> loc(#loc81)
    %5 = stablehlo.subtract %arg0, %4 : tensor<128x10xf32> loc(#loc81)
    %6 = stablehlo.exponential %5 : tensor<128x10xf32> loc(#loc82)
    %7 = stablehlo.reduce(%6 init: %cst) applies stablehlo.add across dimensions = [1] : (tensor<128x10xf32>, tensor<f32>) -> tensor<128xf32> loc(#loc83)
    %8 = stablehlo.broadcast_in_dim %7, dims = [0] : (tensor<128xf32>) -> tensor<128x1xf32> loc(#loc80)
    %9 = stablehlo.log %8 : tensor<128x1xf32> loc(#loc84)
    %10 = stablehlo.broadcast_in_dim %9, dims = [0, 1] : (tensor<128x1xf32>) -> tensor<128x10xf32> loc(#loc81)
    %11 = stablehlo.subtract %5, %10 : tensor<128x10xf32> loc(#loc81)
    return %11, %6, %8 : tensor<128x10xf32>, tensor<128x10xf32>, tensor<128x1xf32> loc(#loc63)
  } loc(#loc63)
  func.func private @log_softmax_1(%arg0: tensor<128x10xf32> loc("jit(train_step)/jit(main)/pjit"(#loc50)), %arg1: tensor<128x1xf32> loc("jit(train_step)/jit(main)/pjit"(#loc50)), %arg2: tensor<128x10xf32> loc("jit(train_step)/jit(main)/pjit"(#loc50))) -> tensor<128x10xf32> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %0 = stablehlo.negate %arg2 : tensor<128x10xf32> loc(#loc85)
    %1 = stablehlo.reduce(%0 init: %cst) applies stablehlo.add across dimensions = [1] : (tensor<128x10xf32>, tensor<f32>) -> tensor<128xf32> loc(#loc86)
    %2 = stablehlo.reshape %1 : (tensor<128xf32>) -> tensor<128x1xf32> loc(#loc87)
    %3 = stablehlo.divide %2, %arg1 : tensor<128x1xf32> loc(#loc88)
    %4 = stablehlo.reduce(%3 init: %cst) applies stablehlo.add across dimensions = [1] : (tensor<128x1xf32>, tensor<f32>) -> tensor<128xf32> loc(#loc86)
    %5 = stablehlo.broadcast_in_dim %4, dims = [0] : (tensor<128xf32>) -> tensor<128x10xf32> loc(#loc89)
    %6 = stablehlo.multiply %5, %arg0 : tensor<128x10xf32> loc(#loc90)
    %7 = stablehlo.add %arg2, %6 : tensor<128x10xf32> loc(#loc91)
    return %7 : tensor<128x10xf32> loc(#loc63)
  } loc(#loc63)
} loc(#loc)
#loc = loc(unknown)
#loc14 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_cnn_train_step.py":11:0 to 0:0)
#loc19 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_cnn_train_step.py":13:0 to 0:0)
#loc20 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_cnn_train_step.py":14:0 to 0:0)
#loc21 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_cnn_train_step.py":15:0 to 0:0)
#loc23 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_cnn_train_step.py":18:0 to 0:0)
#loc25 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_cnn_train_step.py":20:0 to 0:0)
#loc26 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_cnn_train_step.py":21:0 to 0:0)
#loc29 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_cnn_train_step.py":32:0 to 0:0)
#loc30 = loc("forward"(#loc14))
#loc35 = loc("forward"(#loc19))
#loc36 = loc("forward"(#loc20))
#loc37 = loc("forward"(#loc21))
#loc39 = loc("forward"(#loc23))
#loc41 = loc("forward"(#loc25))
#loc42 = loc("forward"(#loc26))
#loc45 = loc("<genexpr>"(#loc29))
#loc46 = loc("train_step"(#loc29))
#loc48 = loc(callsite(#loc46 at #loc33))
#loc52 = loc(callsite(#loc45 at #loc48))
#loc53 = loc(callsite(#loc30 at #loc49))
#loc55 = loc(callsite(#loc35 at #loc49))
#loc56 = loc(callsite(#loc36 at #loc49))
#loc57 = loc(callsite(#loc37 at #loc49))
#loc59 = loc(callsite(#loc39 at #loc49))
#loc61 = loc(callsite(#loc41 at #loc49))
#loc62 = loc(callsite(#loc42 at #loc49))
#loc64 = loc("jit(train_step)/jit(main)/iota"(#loc51))
#loc65 = loc("jit(train_step)/jit(main)/lt"(#loc51))
#loc66 = loc("jit(train_step)/jit(main)/add"(#loc51))
#loc67 = loc("jit(train_step)/jit(main)/select_n"(#loc51))
#loc68 = loc("jit(train_step)/jit(main)/broadcast_in_dim"(#loc51))
#loc69 = loc("jit(train_step)/jit(main)/concatenate"(#loc51))
#loc70 = loc("jit(train_step)/jit(main)/gather"(#loc51))
#loc71 = loc("jit(train_step)/jit(main)/reduce_sum"(#loc51))
#loc72 = loc("jit(train_step)/jit(main)/div"(#loc51))
#loc73 = loc("jit(train_step)/jit(main)/neg"(#loc51))
#loc75 = loc("/add"(#loc51))
#loc76 = loc("jit(train_step)/jit(main)/mul"(#loc52))
#loc77 = loc("jit(train_step)/jit(main)/sub"(#loc52))
#loc78 = loc("jit(train_step)/jit(main)/jvp(jit(log_softmax))/reduce_max"(#loc50))
#loc79 = loc("jit(train_step)/jit(main)/jvp(jit(log_softmax))/max"(#loc50))
#loc80 = loc("jit(train_step)/jit(main)/jvp(jit(log_softmax))/broadcast_in_dim"(#loc50))
#loc81 = loc("jit(train_step)/jit(main)/jvp(jit(log_softmax))/sub"(#loc50))
#loc82 = loc("jit(train_step)/jit(main)/jvp(jit(log_softmax))/exp"(#loc50))
#loc83 = loc("jit(train_step)/jit(main)/jvp(jit(log_softmax))/reduce_sum"(#loc50))
#loc84 = loc("jit(train_step)/jit(main)/jvp(jit(log_softmax))/log"(#loc50))
#loc85 = loc("jit(train_step)/jit(main)/transpose(jvp(jit(log_softmax)))/neg"(#loc50))
#loc86 = loc("jit(train_step)/jit(main)/transpose(jvp(jit(log_softmax)))/reduce_sum"(#loc50))
#loc87 = loc("jit(train_step)/jit(main)/transpose(jvp(jit(log_softmax)))/reshape"(#loc50))
#loc88 = loc("jit(train_step)/jit(main)/transpose(jvp(jit(log_softmax)))/div"(#loc50))
#loc89 = loc("jit(train_step)/jit(main)/transpose(jvp(jit(log_softmax)))/broadcast_in_dim"(#loc50))
#loc90 = loc("jit(train_step)/jit(main)/transpose(jvp(jit(log_softmax)))/mul"(#loc50))
#loc91 = loc("jit(train_step)/jit(main)/transpose(jvp(jit(log_softmax)))/add_any"(#loc50))
#loc92 = loc("jit(train_step)/jit(main)/reshape"(#loc53))
#loc93 = loc("jit(train_step)/jit(main)/conv_general_dilated"(#loc54))
#loc94 = loc("jit(train_step)/jit(main)/reshape"(#loc55))
#loc95 = loc("jit(train_step)/jit(main)/add"(#loc54))
#loc97 = loc("jit(train_step)/jit(main)/gt"(#loc54))
#loc98 = loc("jit(train_step)/jit(main)/conv_general_dilated"(#loc56))
#loc99 = loc("jit(train_step)/jit(main)/reshape"(#loc57))
#loc100 = loc("jit(train_step)/jit(main)/add"(#loc56))
#loc101 = loc("jit(train_step)/jit(main)/pjit"(#loc56))
#loc102 = loc("jit(train_step)/jit(main)/gt"(#loc56))
#loc104 = loc("jit(train_step)/jit(main)/reshape"(#loc59))
#loc105 = loc("jit(train_step)/jit(main)/dot_general"(#loc60))
#loc106 = loc("jit(train_step)/jit(main)/broadcast_in_dim"(#loc60))
#loc107 = loc("jit(train_step)/jit(main)/add"(#loc60))
#loc109 = loc("jit(train_step)/jit(main)/gt"(#loc60))
#loc110 = loc("jit(train_step)/jit(main)/dot_general"(#loc61))
#loc111 = loc("jit(train_step)/jit(main)/broadcast_in_dim"(#loc61))
#loc112 = loc("jit(train_step)/jit(main)/add"(#loc61))
#loc113 = loc("jit(train_step)/jit(main)/pjit"(#loc61))
#loc114 = loc("jit(train_step)/jit(main)/gt"(#loc61))
#loc115 = loc("jit(train_step)/jit(main)/dot_general"(#loc62))
#loc116 = loc("jit(train_step)/jit(main)/broadcast_in_dim"(#loc62))
#loc117 = loc("jit(train_step)/jit(main)/add"(#loc62))
#loc118 = loc("jit(train_step)/jit(main)/reduce_sum"(#loc62))
#loc119 = loc("jit(train_step)/jit(main)/reshape"(#loc62))
#loc120 = loc("jit(train_step)/jit(main)/transpose"(#loc62))
#loc121 = loc("jit(train_step)/jit(main)/select_n"(#loc61))
#loc122 = loc("jit(train_step)/jit(main)/reduce_sum"(#loc61))
#loc123 = loc("jit(train_step)/jit(main)/reshape"(#loc61))
#loc124 = loc("jit(train_step)/jit(main)/transpose"(#loc61))
#loc125 = loc("jit(train_step)/jit(main)/select_n"(#loc60))
#loc126 = loc("jit(train_step)/jit(main)/reduce_sum"(#loc60))
#loc127 = loc("jit(train_step)/jit(main)/reshape"(#loc60))
#loc128 = loc("jit(train_step)/jit(main)/transpose"(#loc60))
#loc129 = loc("jit(train_step)/jit(main)/pad"(#loc58))
#loc131 = loc("jit(train_step)/jit(main)/ge"(#loc58))
#loc132 = loc("jit(train_step)/jit(main)/slice"(#loc58))
#loc133 = loc("jit(train_step)/jit(main)/broadcast_in_dim"(#loc56))
#loc134 = loc("jit(train_step)/jit(main)/select_n"(#loc56))
#loc135 = loc("jit(train_step)/jit(main)/reduce_sum"(#loc56))
#loc136 = loc("jit(train_step)/jit(main)/reshape"(#loc56))
#loc137 = loc("jit(train_step)/jit(main)/rev"(#loc56))
#loc138 = loc("jit(train_step)/jit(main)/broadcast_in_dim"(#loc54))
#loc139 = loc("jit(train_step)/jit(main)/select_n"(#loc54))
#loc140 = loc("jit(train_step)/jit(main)/reduce_sum"(#loc54))
#loc141 = loc("jit(train_step)/jit(main)/reshape"(#loc54))
#loc142 = loc("jit(train_step)/jit(main)/jvp(jit(relu))/max"(#loc54))
#loc143 = loc("jit(train_step)/jit(main)/jvp(jit(relu))/max"(#loc60))
