#loc1 = loc("W0")
#loc2 = loc("b0")
#loc3 = loc("W1")
#loc4 = loc("b1")
#loc5 = loc("W2")
#loc6 = loc("b2")
#loc7 = loc("x")
#loc8 = loc("y")
#loc9 = loc("lr")
#loc10 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_train_step.py":12:0 to 0:0)
#loc11 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_train_step.py":17:0 to 0:0)
#loc12 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_train_step.py":23:0 to 0:0)
#loc13 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_train_step.py":45:0 to 0:0)
#loc16 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_train_step.py":18:0 to 0:0)
#loc17 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_train_step.py":20:0 to 0:0)
#loc24 = loc("forward"(#loc10))
#loc25 = loc("loss_fn"(#loc11))
#loc26 = loc("train_step"(#loc12))
#loc27 = loc("<module>"(#loc13))
#loc30 = loc("loss_fn"(#loc16))
#loc31 = loc("loss_fn"(#loc17))
#loc38 = loc(callsite(#loc26 at #loc27))
#loc45 = loc(callsite(#loc25 at #loc38))
#loc46 = loc(callsite(#loc30 at #loc38))
#loc47 = loc(callsite(#loc31 at #loc38))
#loc60 = loc(callsite(#loc24 at #loc45))
#loc63 = loc("jit(train_step)/jit(main)/pjit"(#loc46))
#loc74 = loc("jit(train_step)/jit(main)/scatter-add"(#loc47))
#loc93 = loc("jit(train_step)/jit(main)/pjit"(#loc60))
module @jit_train_step attributes {jax.uses_shape_polymorphism = false, mhlo.num_partitions = 1 : i32, mhlo.num_replicas = 1 : i32} {
  func.func public @main(%arg0: tensor<784x512xf32> loc("W0"), %arg1: tensor<512xf32> loc("b0"), %arg2: tensor<512x512xf32> loc("W1"), %arg3: tensor<512xf32> loc("b1"), %arg4: tensor<512x10xf32> loc("W2"), %arg5: tensor<10xf32> loc("b2"), %arg6: tensor<128x784xf32> loc("x"), %arg7: tensor<128xi32> loc("y"), %arg8: tensor<f32> loc("lr")) -> (tensor<784x512xf32> {jax.result_info = "result[0]"}, tensor<512xf32> {jax.result_info = "result[1]"}, tensor<512x512xf32> {jax.result_info = "result[2]"}, tensor<512xf32> {jax.result_info = "result[3]"}, tensor<512x10xf32> {jax.result_info = "result[4]"}, tensor<10xf32> {jax.result_info = "result[5]"}, tensor<f32> {jax.result_info = "result[6]"}) {
    %cst = stablehlo.constant dense<1.000000e+00> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<1.280000e+02> : tensor<f32> loc(#loc)
    %c = stablehlo.constant dense<10> : tensor<i32> loc(#loc)
    %c_1 = stablehlo.constant dense<128> : tensor<i32> loc(#loc)
    %c_2 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %cst_3 = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %0 = stablehlo.dot_general %arg6, %arg0, contracting_dims = [1] x [0] : (tensor<128x784xf32>, tensor<784x512xf32>) -> tensor<128x512xf32> loc(#loc90)
    %1 = stablehlo.broadcast_in_dim %arg1, dims = [1] : (tensor<512xf32>) -> tensor<1x512xf32> loc(#loc91)
    %2 = stablehlo.broadcast_in_dim %1, dims = [0, 1] : (tensor<1x512xf32>) -> tensor<128x512xf32> loc(#loc92)
    %3 = stablehlo.add %0, %2 : tensor<128x512xf32> loc(#loc92)
    %4 = call @relu(%3) : (tensor<128x512xf32>) -> tensor<128x512xf32> loc(#loc93)
    %5 = stablehlo.broadcast_in_dim %cst_3, dims = [] : (tensor<f32>) -> tensor<128x512xf32> loc(#loc94)
    %6 = stablehlo.compare  GT, %3, %5,  FLOAT : (tensor<128x512xf32>, tensor<128x512xf32>) -> tensor<128x512xi1> loc(#loc94)
    %7 = stablehlo.dot_general %4, %arg2, contracting_dims = [1] x [0] : (tensor<128x512xf32>, tensor<512x512xf32>) -> tensor<128x512xf32> loc(#loc95)
    %8 = stablehlo.broadcast_in_dim %arg3, dims = [1] : (tensor<512xf32>) -> tensor<1x512xf32> loc(#loc96)
    %9 = stablehlo.broadcast_in_dim %8, dims = [0, 1] : (tensor<1x512xf32>) -> tensor<128x512xf32> loc(#loc97)
    %10 = stablehlo.add %7, %9 : tensor<128x512xf32> loc(#loc97)
    %11 = call @relu(%10) : (tensor<128x512xf32>) -> tensor<128x512xf32> loc(#loc98)
    %12 = stablehlo.broadcast_in_dim %cst_3, dims = [] : (tensor<f32>) -> tensor<128x512xf32> loc(#loc99)
    %13 = stablehlo.compare  GT, %10, %12,  FLOAT : (tensor<128x512xf32>, tensor<128x512xf32>) -> tensor<128x512xi1> loc(#loc99)
    %14 = stablehlo.dot_general %11, %arg4, contracting_dims = [1] x [0] : (tensor<128x512xf32>, tensor<512x10xf32>) -> tensor<128x10xf32> loc(#loc100)
    %15 = stablehlo.broadcast_in_dim %arg5, dims = [1] : (tensor<10xf32>) -> tensor<1x10xf32> loc(#loc101)
    %16 = stablehlo.broadcast_in_dim %15, dims = [0, 1] : (tensor<1x10xf32>) -> tensor<128x10xf32> loc(#loc102)
    %17 = stablehlo.add %14, %16 : tensor<128x10xf32> loc(#loc102)
    %18:3 = call @log_softmax(%17) : (tensor<128x10xf32>) -> (tensor<128x10xf32>, tensor<128x10xf32>, tensor<128x1xf32>) loc(#loc63)
    %19 = stablehlo.iota dim = 0 : tensor<128xi32> loc(#loc64)
    %20 = stablehlo.broadcast_in_dim %c_2, dims = [] : (tensor<i32>) -> tensor<128xi32> loc(#loc65)
    %21 = stablehlo.compare  LT, %19, %20,  SIGNED : (tensor<128xi32>, tensor<128xi32>) -> tensor<128xi1> loc(#loc65)
    %22 = stablehlo.broadcast_in_dim %c_1, dims = [] : (tensor<i32>) -> tensor<128xi32> loc(#loc66)
    %23 = stablehlo.add %19, %22 : tensor<128xi32> loc(#loc66)
    %24 = stablehlo.select %21, %23, %19 : tensor<128xi1>, tensor<128xi32> loc(#loc67)
    %25 = stablehlo.broadcast_in_dim %c_2, dims = [] : (tensor<i32>) -> tensor<128xi32> loc(#loc65)
    %26 = stablehlo.compare  LT, %arg7, %25,  SIGNED : (tensor<128xi32>, tensor<128xi32>) -> tensor<128xi1> loc(#loc65)
    %27 = stablehlo.broadcast_in_dim %c, dims = [] : (tensor<i32>) -> tensor<128xi32> loc(#loc66)
    %28 = stablehlo.add %arg7, %27 : tensor<128xi32> loc(#loc66)
    %29 = stablehlo.select %26, %28, %arg7 : tensor<128xi1>, tensor<128xi32> loc(#loc67)
    %30 = stablehlo.broadcast_in_dim %24, dims = [0] : (tensor<128xi32>) -> tensor<128x1xi32> loc(#loc68)
    %31 = stablehlo.broadcast_in_dim %29, dims = [0] : (tensor<128xi32>) -> tensor<128x1xi32> loc(#loc68)
    %32 = stablehlo.concatenate %30, %31, dim = 1 : (tensor<128x1xi32>, tensor<128x1xi32>) -> tensor<128x2xi32> loc(#loc69)
    %33 = "stablehlo.gather"(%18#0, %32) <{dimension_numbers = #stablehlo.gather<collapsed_slice_dims = [0, 1], start_index_map = [0, 1], index_vector_dim = 1>, slice_sizes = array<i64: 1, 1>}> : (tensor<128x10xf32>, tensor<128x2xi32>) -> tensor<128xf32> loc(#loc70)
    %34 = stablehlo.reduce(%33 init: %cst_3) applies stablehlo.add across dimensions = [0] : (tensor<128xf32>, tensor<f32>) -> tensor<f32> loc(#loc71)
    %35 = stablehlo.divide %34, %cst_0 : tensor<f32> loc(#loc72)
    %36 = stablehlo.negate %35 : tensor<f32> loc(#loc73)
    %37 = stablehlo.negate %cst : tensor<f32> loc(#loc73)
    %38 = stablehlo.divide %37, %cst_0 : tensor<f32> loc(#loc72)
    %39 = stablehlo.broadcast_in_dim %38, dims = [] : (tensor<f32>) -> tensor<128xf32> loc(#loc68)
    %40 = stablehlo.reduce(%39 init: %cst_3) applies stablehlo.add across dimensions = [] : (tensor<128xf32>, tensor<f32>) -> tensor<128xf32> loc(#loc71)
    %41 = stablehlo.broadcast_in_dim %cst_3, dims = [] : (tensor<f32>) -> tensor<128x10xf32> loc(#loc68)
    %42 = "stablehlo.scatter"(%41, %32, %40) <{scatter_dimension_numbers = #stablehlo.scatter<inserted_window_dims = [0, 1], scatter_dims_to_operand_dims = [0, 1], index_vector_dim = 1>}> ({
    ^bb0(%arg9: tensor<f32> loc("jit(train_step)/jit(main)/scatter-add"(#loc47)), %arg10: tensor<f32> loc("jit(train_step)/jit(main)/scatter-add"(#loc47))):
      %83 = stablehlo.add %arg9, %arg10 : tensor<f32> loc(#loc75)
      stablehlo.return %83 : tensor<f32> loc(#loc74)
    }) : (tensor<128x10xf32>, tensor<128x2xi32>, tensor<128xf32>) -> tensor<128x10xf32> loc(#loc74)
    %43 = call @log_softmax_0(%18#1, %18#2, %42) : (tensor<128x10xf32>, tensor<128x1xf32>, tensor<128x10xf32>) -> tensor<128x10xf32> loc(#loc63)
    %44 = stablehlo.reduce(%43 init: %cst_3) applies stablehlo.add across dimensions = [0] : (tensor<128x10xf32>, tensor<f32>) -> tensor<10xf32> loc(#loc103)
    %45 = stablehlo.reshape %44 : (tensor<10xf32>) -> tensor<1x10xf32> loc(#loc104)
    %46 = stablehlo.reduce(%45 init: %cst_3) applies stablehlo.add across dimensions = [0] : (tensor<1x10xf32>, tensor<f32>) -> tensor<10xf32> loc(#loc103)
    %47 = stablehlo.dot_general %43, %11, contracting_dims = [0] x [0] : (tensor<128x10xf32>, tensor<128x512xf32>) -> tensor<10x512xf32> loc(#loc100)
    %48 = stablehlo.transpose %47, dims = [1, 0] : (tensor<10x512xf32>) -> tensor<512x10xf32> loc(#loc105)
    %49 = stablehlo.dot_general %43, %arg4, contracting_dims = [1] x [1] : (tensor<128x10xf32>, tensor<512x10xf32>) -> tensor<128x512xf32> loc(#loc100)
    %50 = stablehlo.broadcast_in_dim %cst_3, dims = [] : (tensor<f32>) -> tensor<128x512xf32> loc(#loc96)
    %51 = stablehlo.select %13, %49, %50 : tensor<128x512xi1>, tensor<128x512xf32> loc(#loc106)
    %52 = stablehlo.reduce(%51 init: %cst_3) applies stablehlo.add across dimensions = [0] : (tensor<128x512xf32>, tensor<f32>) -> tensor<512xf32> loc(#loc107)
    %53 = stablehlo.reshape %52 : (tensor<512xf32>) -> tensor<1x512xf32> loc(#loc108)
    %54 = stablehlo.reduce(%53 init: %cst_3) applies stablehlo.add across dimensions = [0] : (tensor<1x512xf32>, tensor<f32>) -> tensor<512xf32> loc(#loc107)
    %55 = stablehlo.dot_general %51, %4, contracting_dims = [0] x [0] : (tensor<128x512xf32>, tensor<128x512xf32>) -> tensor<512x512xf32> loc(#loc95)
    %56 = stablehlo.transpose %55, dims = [1, 0] : (tensor<512x512xf32>) -> tensor<512x512xf32> loc(#loc109)
    %57 = stablehlo.dot_general %51, %arg2, contracting_dims = [1] x [1] : (tensor<128x512xf32>, tensor<512x512xf32>) -> tensor<128x512xf32> loc(#loc95)
    %58 = stablehlo.broadcast_in_dim %cst_3, dims = [] : (tensor<f32>) -> tensor<128x512xf32> loc(#loc91)
    %59 = stablehlo.select %6, %57, %58 : tensor<128x512xi1>, tensor<128x512xf32> loc(#loc110)
    %60 = stablehlo.reduce(%59 init: %cst_3) applies stablehlo.add across dimensions = [0] : (tensor<128x512xf32>, tensor<f32>) -> tensor<512xf32> loc(#loc111)
    %61 = stablehlo.reshape %60 : (tensor<512xf32>) -> tensor<1x512xf32> loc(#loc112)
    %62 = stablehlo.reduce(%61 init: %cst_3) applies stablehlo.add across dimensions = [0] : (tensor<1x512xf32>, tensor<f32>) -> tensor<512xf32> loc(#loc111)
    %63 = stablehlo.dot_general %59, %arg6, contracting_dims = [0] x [0] : (tensor<128x512xf32>, tensor<128x784xf32>) -> tensor<512x784xf32> loc(#loc90)
    %64 = stablehlo.transpose %63, dims = [1, 0] : (tensor<512x784xf32>) -> tensor<784x512xf32> loc(#loc113)
    %65 = stablehlo.broadcast_in_dim %arg8, dims = [] : (tensor<f32>) -> tensor<784x512xf32> loc(#loc48)
    %66 = stablehlo.multiply %65, %64 : tensor<784x512xf32> loc(#loc48)
    %67 = stablehlo.subtract %arg0, %66 : tensor<784x512xf32> loc(#loc49)
    %68 = stablehlo.broadcast_in_dim %arg8, dims = [] : (tensor<f32>) -> tensor<512xf32> loc(#loc50)
    %69 = stablehlo.multiply %68, %62 : tensor<512xf32> loc(#loc50)
    %70 = stablehlo.subtract %arg1, %69 : tensor<512xf32> loc(#loc51)
    %71 = stablehlo.broadcast_in_dim %arg8, dims = [] : (tensor<f32>) -> tensor<512x512xf32> loc(#loc52)
    %72 = stablehlo.multiply %71, %56 : tensor<512x512xf32> loc(#loc52)
    %73 = stablehlo.subtract %arg2, %72 : tensor<512x512xf32> loc(#loc53)
    %74 = stablehlo.broadcast_in_dim %arg8, dims = [] : (tensor<f32>) -> tensor<512xf32> loc(#loc54)
    %75 = stablehlo.multiply %74, %54 : tensor<512xf32> loc(#loc54)
    %76 = stablehlo.subtract %arg3, %75 : tensor<512xf32> loc(#loc55)
    %77 = stablehlo.broadcast_in_dim %arg8, dims = [] : (tensor<f32>) -> tensor<512x10xf32> loc(#loc56)
    %78 = stablehlo.multiply %77, %48 : tensor<512x10xf32> loc(#loc56)
    %79 = stablehlo.subtract %arg4, %78 : tensor<512x10xf32> loc(#loc57)
    %80 = stablehlo.broadcast_in_dim %arg8, dims = [] : (tensor<f32>) -> tensor<10xf32> loc(#loc58)
    %81 = stablehlo.multiply %80, %46 : tensor<10xf32> loc(#loc58)
    %82 = stablehlo.subtract %arg5, %81 : tensor<10xf32> loc(#loc59)
    return %67, %70, %73, %76, %79, %82, %36 : tensor<784x512xf32>, tensor<512xf32>, tensor<512x512xf32>, tensor<512xf32>, tensor<512x10xf32>, tensor<10xf32>, tensor<f32> loc(#loc)
  } loc(#loc)
  func.func private @relu(%arg0: tensor<128x512xf32> loc("jit(train_step)/jit(main)/pjit"(#loc60))) -> tensor<128x512xf32> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc93)
    %0 = stablehlo.broadcast_in_dim %cst, dims = [] : (tensor<f32>) -> tensor<128x512xf32> loc(#loc114)
    %1 = stablehlo.maximum %arg0, %0 : tensor<128x512xf32> loc(#loc114)
    return %1 : tensor<128x512xf32> loc(#loc93)
  } loc(#loc93)
  func.func private @log_softmax(%arg0: tensor<128x10xf32> loc("jit(train_step)/jit(main)/pjit"(#loc46))) -> (tensor<128x10xf32>, tensor<128x10xf32>, tensor<128x1xf32>) {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<0xFF800000> : tensor<f32> loc(#loc)
    %0 = stablehlo.reduce(%arg0 init: %cst_0) applies stablehlo.maximum across dimensions = [1] : (tensor<128x10xf32>, tensor<f32>) -> tensor<128xf32> loc(#loc76)
    %1 = stablehlo.broadcast_in_dim %cst_0, dims = [] : (tensor<f32>) -> tensor<128xf32> loc(#loc77)
    %2 = stablehlo.maximum %1, %0 : tensor<128xf32> loc(#loc77)
    %3 = stablehlo.broadcast_in_dim %2, dims = [0] : (tensor<128xf32>) -> tensor<128x1xf32> loc(#loc78)
    %4 = stablehlo.broadcast_in_dim %3, dims = [0, 1] : (tensor<128x1xf32>) -> tensor<128x10xf32> loc(#loc79)
    %5 = stablehlo.subtract %arg0, %4 : tensor<128x10xf32> loc(#loc79)
    %6 = stablehlo.exponential %5 : tensor<128x10xf32> loc(#loc80)
    %7 = stablehlo.reduce(%6 init: %cst) applies stablehlo.add across dimensions = [1] : (tensor<128x10xf32>, tensor<f32>) -> tensor<128xf32> loc(#loc81)
    %8 = stablehlo.broadcast_in_dim %7, dims = [0] : (tensor<128xf32>) -> tensor<128x1xf32> loc(#loc78)
    %9 = stablehlo.log %8 : tensor<128x1xf32> loc(#loc82)
    %10 = stablehlo.broadcast_in_dim %9, dims = [0, 1] : (tensor<128x1xf32>) -> tensor<128x10xf32> loc(#loc79)
    %11 = stablehlo.subtract %5, %10 : tensor<128x10xf32> loc(#loc79)
    return %11, %6, %8 : tensor<128x10xf32>, tensor<128x10xf32>, tensor<128x1xf32> loc(#loc63)
  } loc(#loc63)
  func.func private @log_softmax_0(%arg0: tensor<128x10xf32> loc("jit(train_step)/jit(main)/pjit"(#loc46)), %arg1: tensor<128x1xf32> loc("jit(train_step)/jit(main)/pjit"(#loc46)), %arg2: tensor<128x10xf32> loc("jit(train_step)/jit(main)/pjit"(#loc46))) -> tensor<128x10xf32> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %0 = stablehlo.negate %arg2 : tensor<128x10xf32> loc(#loc83)
    %1 = stablehlo.reduce(%0 init: %cst) applies stablehlo.add across dimensions = [1] : (tensor<128x10xf32>, tensor<f32>) -> tensor<128xf32> loc(#loc84)
    %2 = stablehlo.reshape %1 : (tensor<128xf32>) -> tensor<128x1xf32> loc(#loc85)
    %3 = stablehlo.divide %2, %arg1 : tensor<128x1xf32> loc(#loc86)
    %4 = stablehlo.reduce(%3 init: %cst) applies stablehlo.add across dimensions = [1] : (tensor<128x1xf32>, tensor<f32>) -> tensor<128xf32> loc(#loc84)
    %5 = stablehlo.broadcast_in_dim %4, dims = [0] : (tensor<128xf32>) -> tensor<128x10xf32> loc(#loc87)
    %6 = stablehlo.multiply %5, %arg0 : tensor<128x10xf32> loc(#loc88)
    %7 = stablehlo.add %arg2, %6 : tensor<128x10xf32> loc(#loc89)
    return %7 : tensor<128x10xf32> loc(#loc63)
  } loc(#loc63)
} loc(#loc)
#loc = loc(unknown)
#loc14 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_train_step.py":13:0 to 0:0)
#loc15 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_train_step.py":14:0 to 0:0)
#loc18 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_train_step.py":26:0 to 0:0)
#loc19 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_train_step.py":27:0 to 0:0)
#loc20 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_train_step.py":28:0 to 0:0)
#loc21 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_train_step.py":29:0 to 0:0)
#loc22 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_train_step.py":30:0 to 0:0)
#loc23 = loc("/home/skoonce/lean/klawd_max_power/lean4-jax-mlir/mlir_poc/export_train_step.py":31:0 to 0:0)
#loc28 = loc("forward"(#loc14))
#loc29 = loc("forward"(#loc15))
#loc32 = loc("train_step"(#loc18))
#loc33 = loc("train_step"(#loc19))
#loc34 = loc("train_step"(#loc20))
#loc35 = loc("train_step"(#loc21))
#loc36 = loc("train_step"(#loc22))
#loc37 = loc("train_step"(#loc23))
#loc39 = loc(callsite(#loc32 at #loc27))
#loc40 = loc(callsite(#loc33 at #loc27))
#loc41 = loc(callsite(#loc34 at #loc27))
#loc42 = loc(callsite(#loc35 at #loc27))
#loc43 = loc(callsite(#loc36 at #loc27))
#loc44 = loc(callsite(#loc37 at #loc27))
#loc48 = loc("jit(train_step)/jit(main)/mul"(#loc39))
#loc49 = loc("jit(train_step)/jit(main)/sub"(#loc39))
#loc50 = loc("jit(train_step)/jit(main)/mul"(#loc40))
#loc51 = loc("jit(train_step)/jit(main)/sub"(#loc40))
#loc52 = loc("jit(train_step)/jit(main)/mul"(#loc41))
#loc53 = loc("jit(train_step)/jit(main)/sub"(#loc41))
#loc54 = loc("jit(train_step)/jit(main)/mul"(#loc42))
#loc55 = loc("jit(train_step)/jit(main)/sub"(#loc42))
#loc56 = loc("jit(train_step)/jit(main)/mul"(#loc43))
#loc57 = loc("jit(train_step)/jit(main)/sub"(#loc43))
#loc58 = loc("jit(train_step)/jit(main)/mul"(#loc44))
#loc59 = loc("jit(train_step)/jit(main)/sub"(#loc44))
#loc61 = loc(callsite(#loc28 at #loc45))
#loc62 = loc(callsite(#loc29 at #loc45))
#loc64 = loc("jit(train_step)/jit(main)/iota"(#loc47))
#loc65 = loc("jit(train_step)/jit(main)/lt"(#loc47))
#loc66 = loc("jit(train_step)/jit(main)/add"(#loc47))
#loc67 = loc("jit(train_step)/jit(main)/select_n"(#loc47))
#loc68 = loc("jit(train_step)/jit(main)/broadcast_in_dim"(#loc47))
#loc69 = loc("jit(train_step)/jit(main)/concatenate"(#loc47))
#loc70 = loc("jit(train_step)/jit(main)/gather"(#loc47))
#loc71 = loc("jit(train_step)/jit(main)/reduce_sum"(#loc47))
#loc72 = loc("jit(train_step)/jit(main)/div"(#loc47))
#loc73 = loc("jit(train_step)/jit(main)/neg"(#loc47))
#loc75 = loc("/add"(#loc47))
#loc76 = loc("jit(train_step)/jit(main)/jvp(jit(log_softmax))/reduce_max"(#loc46))
#loc77 = loc("jit(train_step)/jit(main)/jvp(jit(log_softmax))/max"(#loc46))
#loc78 = loc("jit(train_step)/jit(main)/jvp(jit(log_softmax))/broadcast_in_dim"(#loc46))
#loc79 = loc("jit(train_step)/jit(main)/jvp(jit(log_softmax))/sub"(#loc46))
#loc80 = loc("jit(train_step)/jit(main)/jvp(jit(log_softmax))/exp"(#loc46))
#loc81 = loc("jit(train_step)/jit(main)/jvp(jit(log_softmax))/reduce_sum"(#loc46))
#loc82 = loc("jit(train_step)/jit(main)/jvp(jit(log_softmax))/log"(#loc46))
#loc83 = loc("jit(train_step)/jit(main)/transpose(jvp(jit(log_softmax)))/neg"(#loc46))
#loc84 = loc("jit(train_step)/jit(main)/transpose(jvp(jit(log_softmax)))/reduce_sum"(#loc46))
#loc85 = loc("jit(train_step)/jit(main)/transpose(jvp(jit(log_softmax)))/reshape"(#loc46))
#loc86 = loc("jit(train_step)/jit(main)/transpose(jvp(jit(log_softmax)))/div"(#loc46))
#loc87 = loc("jit(train_step)/jit(main)/transpose(jvp(jit(log_softmax)))/broadcast_in_dim"(#loc46))
#loc88 = loc("jit(train_step)/jit(main)/transpose(jvp(jit(log_softmax)))/mul"(#loc46))
#loc89 = loc("jit(train_step)/jit(main)/transpose(jvp(jit(log_softmax)))/add_any"(#loc46))
#loc90 = loc("jit(train_step)/jit(main)/dot_general"(#loc60))
#loc91 = loc("jit(train_step)/jit(main)/broadcast_in_dim"(#loc60))
#loc92 = loc("jit(train_step)/jit(main)/add"(#loc60))
#loc94 = loc("jit(train_step)/jit(main)/gt"(#loc60))
#loc95 = loc("jit(train_step)/jit(main)/dot_general"(#loc61))
#loc96 = loc("jit(train_step)/jit(main)/broadcast_in_dim"(#loc61))
#loc97 = loc("jit(train_step)/jit(main)/add"(#loc61))
#loc98 = loc("jit(train_step)/jit(main)/pjit"(#loc61))
#loc99 = loc("jit(train_step)/jit(main)/gt"(#loc61))
#loc100 = loc("jit(train_step)/jit(main)/dot_general"(#loc62))
#loc101 = loc("jit(train_step)/jit(main)/broadcast_in_dim"(#loc62))
#loc102 = loc("jit(train_step)/jit(main)/add"(#loc62))
#loc103 = loc("jit(train_step)/jit(main)/reduce_sum"(#loc62))
#loc104 = loc("jit(train_step)/jit(main)/reshape"(#loc62))
#loc105 = loc("jit(train_step)/jit(main)/transpose"(#loc62))
#loc106 = loc("jit(train_step)/jit(main)/select_n"(#loc61))
#loc107 = loc("jit(train_step)/jit(main)/reduce_sum"(#loc61))
#loc108 = loc("jit(train_step)/jit(main)/reshape"(#loc61))
#loc109 = loc("jit(train_step)/jit(main)/transpose"(#loc61))
#loc110 = loc("jit(train_step)/jit(main)/select_n"(#loc60))
#loc111 = loc("jit(train_step)/jit(main)/reduce_sum"(#loc60))
#loc112 = loc("jit(train_step)/jit(main)/reshape"(#loc60))
#loc113 = loc("jit(train_step)/jit(main)/transpose"(#loc60))
#loc114 = loc("jit(train_step)/jit(main)/jvp(jit(relu))/max"(#loc60))
